# 21.Дан список целых чисел, число k и значение C. Необходимо вставить в
# список на позицию с индексом k элемент, равный C, сдвинув все
# элементы имевшие индекс не менее k вправо. Поскольку при этом
# количество элементов в списке увеличивается, после считывания списка
# в его конец нужно будет добавить новый элемент, используя метод
# append(). Вставку необходимо осуществлять уже в считанном списке, не
# делая этого при выводе и не создавая дополнительного списка.(input: 7,
# 6, 5, 4, 3, 2, 1, 2, 0 output: 7, 6, 0, 5, 4, 3, 2, 1)

